app/controllers/films_controller.rb

    def create
        @film = Film.new(film_params)
        #if the admin uploader has not specified the type, then it is set to student and not base
        if @film.film_type.nil?
            @film.film_type = 0
        end
        #Create and save all film tags
        if @film.save!
            for tag_name in @film.tag_names.split
                @film_tag = FilmTag.new
                @tag = Tag.has_name(tag_name).to_a.first
                if @tag.nil?
                    @tag = Tag.new
                    @tag.name = tag_name
                    @tag.save
---
INSERT INTO "films" ("title", "director", "film_path", "permission", "description", "film_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "tags".* FROM "tags" WHERE "tags"."name" = $1  [["name", "hamster"]]
INSERT INTO "film_tags" ("film_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["film_id", 7], ["tag_id", 1], ["created_at", "2018-05-01 02:58:04.741149"], ["updated_at", "2018-05-01 02:58:04.741149"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "hamster"], ["created_at", "2018-05-01 02:58:04.709427"], ["updated_at", "2018-05-01 02:58:04.709427"]]

    def set_film
        @film = Film.find(params[:id])
---
SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT 1  [["id", 6]]